1.Introduction
This assignment will help you to consolidate the concepts learnt in the session.
2.Problem Statement
It happens all the time: someone gives you data containing malformed strings,
Python, lists and missing data. How do you tidy it up so you can get on with the
analysis?
Take this monstrosity as the DataFrame to use in the following puzzles:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})
1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).
2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.
3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)
4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.
5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each 
second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.
Note: Solution submitted via github must contain all the source code and output.
3. Expected Output
This assignment consists of 200 marks and has to be submitted in .ipynb format in
the upcoming session for evaluation.

In [0]:
import pandas as pd
import numpy as np

# Take airline dataframe here 

data_frame_airline_journay = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})
print(data_frame_airline_journay)
# print col types
print(data_frame_airline_journay.dtypes)



```
#  task1 
```

In [2]:

# In place replace fillna values
data_frame_airline_journay.FlightNumber.fillna(0,inplace=True)
# change type of column to to number 

data_frame_airline_journay['FlightNumber'].astype(int)
# increase value by 10 if not nan 
increase_by_value = lambda x: x +10 if x>0 else x
data_frame_airline_journay.FlightNumber.apply(increase_by_value)

print("task 1 result is /n")
print(data_frame_airline_journay)

task 1 result is /n
            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           0.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           0.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"



```
# Task2
```

In [5]:
'''The From_To column would be better as two separate columns!
Split each string on the underscore delimiter _ 
to give a new temporary DataFrame with the correct values.
Assign the correct column names to this temporary DataFrame.'''
data_frame_airline_journay[['From City','To City']] = data_frame_airline_journay.From_To.apply( 
   lambda x: pd.Series(str(x).split("_"))) 

print(data_frame_airline_journay)

            From_To  FlightNumber  ... From City    To City
0      LoNDon_paris       10045.0  ...    LoNDon      paris
1      MAdrid_miLAN           0.0  ...    MAdrid      miLAN
2  londON_StockhOlm       10065.0  ...    londON  StockhOlm
3    Budapest_PaRis           0.0  ...  Budapest      PaRis
4   Brussels_londOn       10085.0  ...  Brussels     londOn

[5 rows x 6 columns]



```
#  task 3 
'''Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)'''
```

In [0]:
data_frame_airline_journay['From City']=data_frame_airline_journay['To City'].str.upper()
data_frame_airline_journay['To City']=data_frame_airline_journay['To City'].str.upper()
print(data_frame_airline_journay)



```
# task 4 

'''Delete the From_To column from df and attach the temporary DataFrame from the previous questions.'''
```

In [6]:
data_frame_airline_journay.drop(['From_To'], axis=1)

   FlightNumber  RecentDelays              Airline From City    To City
0       10045.0      [23, 47]               KLM(!)    LoNDon      paris
1           0.0            []    <Air France> (12)    MAdrid      miLAN
2       10065.0  [24, 43, 87]  (British Airways. )    londON  StockhOlm
3           0.0          [13]       12. Air France  Budapest      PaRis
4       10085.0      [67, 32]          "Swiss Air"  Brussels     londOn



```
# ###### task 5
#In the RecentDelays column, 
#the values have been entered into the DataFrame as a list.
#We would like each first value in its own column, 
#each second value in its own column, and so on. 
#If there isn't an Nth value, the value should be NaN.
#Expand the Series of lists into a DataFrame named delays, 
#rename the columns delay_1, delay_2, etc. and replace the unwanted 
#RecentDelays column in df with delays. Note: Solution submitted
#via github must contain all the source code and output.
```

In [9]:
recentDelays_col_values=data_frame_airline_journay['RecentDelays'].values.tolist()
print (recentDelays_col_values)

# split list values into new data frame and 
lists_to_columns_with_prefix_name = pd.DataFrame(recentDelays_col_values).add_prefix('Delays_')
print(lists_to_columns_with_prefix_name)
data_frame_airline_journay=data_frame_airline_journay.drop(['RecentDelays'], axis=1)
print("Removed column -- data_frame_airline_journay")
data_frame_airline_journay.join(lists_to_columns_with_prefix_name)

[[23, 47], [], [24, 43, 87], [13], [67, 32]]
   Delays_0  Delays_1  Delays_2
0      23.0      47.0       NaN
1       NaN       NaN       NaN
2      24.0      43.0      87.0
3      13.0       NaN       NaN
4      67.0      32.0       NaN
Removed column -- data_frame_airline_journay

            From_To  FlightNumber  ... Delays_1 Delays_2
0      LoNDon_paris       10045.0  ...     47.0      NaN
1      MAdrid_miLAN           0.0  ...      NaN      NaN
2  londON_StockhOlm       10065.0  ...     43.0     87.0
3    Budapest_PaRis           0.0  ...      NaN      NaN
4   Brussels_londOn       10085.0  ...     32.0      NaN

[5 rows x 8 columns]